# TODO: !!! Нужно в CI\CD делать backup БД перед накатом новой версии.
# TODO: Добавить поле кто  создал ссылку и кто её отредактировал. Поиск по автору. Галочка "Показывать только мои ссылки".
# TODO: В списке ссылок поле short_link нужно выводить короткую ссылку целиком, чтобы было удобно копировать. Или сделать кнопочку копировать, чтобы сразу в буфер обмена копировалось.
# TODO: Не нужно кнопку, нужно просто форму создания возвращать сразу с проставленным слагом, если человек хочет, то может удалить его и поставить свой. Сделать кнопку генерации слага - слаг нужно проверять на уникальность.
# TODO: Добавить в Link creater, editor (те кто создал ссылку и последний редактор). https://docs.djangoproject.com/en/4.1/topics/class-based-views/generic-editing/#models-and-request-user
# TODO: При заходе на s.gs.org перебрасывать на основной сайт школы.   /app/home
